Extensions/УВМ/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/HTTPServices/УВМ_ИнтеграцияTMS/Ext/Module.bsl
#Область ОбработчикиСобытий

Функция ДанныеПоЗарплатеGET(Запрос)
	
	РезультатПолученияПараметров = ОбязательныеПараметры("start, end, inn, position", Запрос);
	Если РезультатПолученияПараметров.Ошибки.Количество() Тогда
		
		СписокОшибок = СтрСоединить(РезультатПолученияПараметров.Ошибки, ";");
		
		Ответ = Новый HTTPСервисОтвет(400);
		ДобавитьЗаголовкиДанных(Ответ);
		Ответ.УстановитьТелоИзСтроки(СписокОшибок);
		Возврат Ответ;
		
	КонецЕсли;
	
	ПараметрыЗапроса = РезультатПолученияПараметров.Параметры;
	
	Ошибки = Новый Массив;
	ДатаНачала = СтроковыеФункцииКлиентСервер.СтрокаВДату(ПараметрыЗапроса.start);
	ДатаОкончания = СтроковыеФункцииКлиентСервер.СтрокаВДату(ПараметрыЗапроса.end);
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Ошибки.Добавить("Не удалось распознать дату начала периода");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Ошибки.Добавить("Не удалось распознать дату окончания периода");
	КонецЕсли;
	
	Если Ошибки.Количество() Тогда
		
		СписокОшибок = СтрСоединить(РезультатПолученияПараметров.Ошибки, ";");
		
		Ответ = Новый HTTPСервисОтвет(400);
		ДобавитьЗаголовкиДанных(Ответ);
		Ответ.УстановитьТелоИзСтроки(СписокОшибок);
		Возврат Ответ;
		
	КонецЕсли;
	
	ДанныеПоЗарплате = ДанныеПоЗаработнойПлате(ПараметрыЗапроса.inn, ПараметрыЗапроса.position, ДатаНачала, ДатаОкончания);
	ТелоОтвета = СтрокаJSON(ДанныеПоЗарплате);
	
	Ответ = Новый HTTPСервисОтвет(200);
	ДобавитьЗаголовкиДанных(Ответ);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Функция PingGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПоЗаработнойПлате(ИННОрганизации, Должность, ДатаНачала, ДатаОкончания)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИННОрганизации);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Должности.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втДолжности
	|ИЗ
	|	Справочник.Должности КАК Должности
	|ГДЕ
	|	Должности.Наименование = &Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	|	КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация КАК Организация
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация В
	|			(ВЫБРАТЬ
	|				втОрганизации.Ссылка
	|			ИЗ
	|				втОрганизации)
	|	И КадроваяИсторияСотрудниковСрезПоследних.Должность В
	|			(ВЫБРАТЬ
	|				втДолжности.Ссылка
	|			ИЗ
	|				втДолжности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыПоФизическимЛицам.Период КАК Период,
	|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРДоПредельнойВеличины + СтраховыеВзносыПоФизическимЛицам.ПФРСПревышения + СтраховыеВзносыПоФизическимЛицам.ПФРПоСуммарномуТарифу + СтраховыеВзносыПоФизическимЛицам.ФСС + СтраховыеВзносыПоФизическимЛицам.ФССНесчастныеСлучаи + СтраховыеВзносыПоФизическимЛицам.ФФОМС + СтраховыеВзносыПоФизическимЛицам.ПФРНаДоплатуЛетчикам + СтраховыеВзносыПоФизическимЛицам.ПФРНаДоплатуШахтерам + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + СтраховыеВзносыПоФизическимЛицам.ПФРСтраховая + СтраховыеВзносыПоФизическимЛицам.ПФРНакопительная + СтраховыеВзносыПоФизическимЛицам.ТФОМС + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки + СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка) КАК Сумма,
	|	СтраховыеВзносыПоФизическимЛицам.Сотрудник КАК Сотрудник,
	|	СтраховыеВзносыПоФизическимЛицам.Организация КАК Организация,
	|	СтраховыеВзносыПоФизическимЛицам.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ втВзносы
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыПоФизическимЛицам КАК СтраховыеВзносыПоФизическимЛицам
	|ГДЕ
	|	СтраховыеВзносыПоФизическимЛицам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (СтраховыеВзносыПоФизическимЛицам.Организация, СтраховыеВзносыПоФизическимЛицам.ФизическоеЛицо, СтраховыеВзносыПоФизическимЛицам.Сотрудник) В
	|			(ВЫБРАТЬ
	|				втСотрудники.Организация,
	|				втСотрудники.ФизическоеЛицо,
	|				втСотрудники.Сотрудник
	|			ИЗ
	|				втСотрудники)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыПоФизическимЛицам.Период,
	|	СтраховыеВзносыПоФизическимЛицам.Сотрудник,
	|	СтраховыеВзносыПоФизическимЛицам.Организация,
	|	СтраховыеВзносыПоФизическимЛицам.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудники.Сотрудник КАК Сотрудник,
	|	втСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	втСотрудники.Должность КАК Должность,
	|	втСотрудники.Организация КАК Организация,
	|	СУММА(НачисленияУдержанияПоСотрудникамАвансом.Сумма) КАК Сумма,
	|	НачисленияУдержанияПоСотрудникамАвансом.Период КАК Период
	|ПОМЕСТИТЬ втАвансы
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияУдержанияПоСотрудникамАвансом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудники КАК втСотрудники
	|		ПО (НачисленияУдержанияПоСотрудникамАвансом.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И НачисленияУдержанияПоСотрудникамАвансом.Организация = втСотрудники.Организация
	|			И НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо = втСотрудники.ФизическоеЛицо
	|			И НачисленияУдержанияПоСотрудникамАвансом.Сотрудник = втСотрудники.Сотрудник
	|			И (НачисленияУдержанияПоСотрудникамАвансом.НачислениеУдержание.Наименование <> ""НДФЛ"")
	|
	|СГРУППИРОВАТЬ ПО
	|	втСотрудники.Сотрудник,
	|	втСотрудники.ФизическоеЛицо,
	|	втСотрудники.Должность,
	|	втСотрудники.Организация,
	|	НачисленияУдержанияПоСотрудникамАвансом.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудники.Сотрудник КАК Сотрудник,
	|	втСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	втСотрудники.Должность КАК Должность,
	|	втСотрудники.Организация КАК Организация,
	|	НачисленияУдержанияПоСотрудникам.Период КАК Период,
	|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) КАК Сумма
	|ПОМЕСТИТЬ втЗарплата
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудники КАК втСотрудники
	|		ПО (НачисленияУдержанияПоСотрудникам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И НачисленияУдержанияПоСотрудникам.Организация = втСотрудники.Организация
	|			И (втСотрудники.ФизическоеЛицо = НачисленияУдержанияПоСотрудникам.ФизическоеЛицо)
	|			И (втСотрудники.Сотрудник = НачисленияУдержанияПоСотрудникам.Сотрудник)
	|			И (НачисленияУдержанияПоСотрудникам.НачислениеУдержание.Наименование <> ""НДФЛ"")
	|
	|СГРУППИРОВАТЬ ПО
	|	втСотрудники.Сотрудник,
	|	втСотрудники.ФизическоеЛицо,
	|	втСотрудники.Должность,
	|	втСотрудники.Организация,
	|	НачисленияУдержанияПоСотрудникам.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗарплата.Период КАК Месяц,
	|	СУММА(втЗарплата.Сумма + ЕСТЬNULL(втВзносы.Сумма, 0) - ЕСТЬNULL(втАвансы.Сумма, 0)) КАК Сумма,
	|	""ЗарплатаЗаМесяц"" КАК СпособВыплаты
	|ИЗ
	|	втЗарплата КАК втЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАвансы КАК втАвансы
	|		ПО (втАвансы.Сотрудник = втЗарплата.Сотрудник)
	|			И (втАвансы.ФизическоеЛицо = втЗарплата.ФизическоеЛицо)
	|			И (втАвансы.Организация = втЗарплата.Организация)
	|			И (втАвансы.Период = втЗарплата.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВзносы КАК втВзносы
	|		ПО (втВзносы.Период = втЗарплата.Период)
	|			И (втВзносы.Организация = втЗарплата.Организация)
	|			И (втВзносы.Сотрудник = втЗарплата.Сотрудник)
	|			И (втВзносы.ФизическоеЛицо = втЗарплата.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗарплата.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втАвансы.Период,
	|	СУММА(втАвансы.Сумма),
	|	""Аванс""
	|ИЗ
	|	втАвансы КАК втАвансы
	|
	|СГРУППИРОВАТЬ ПО
	|	втАвансы.Период";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса);
	
	Возврат МассивДанных;
	
КонецФункции

Функция ОбязательныеПараметры(ПараметрыСтрокой, Запрос)

	МассивОшибок = Новый Массив;
	МассивПараметров = СтрРазделить(ПараметрыСтрокой, ", ", Ложь);
	
	СтруктураПараметров = Новый Структура;
	Для каждого ТекущийПараметр из МассивПараметров Цикл
		СтруктураПараметров.Вставить(ТекущийПараметр, Неопределено);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Запрос.ПараметрыЗапроса);
	
	Для каждого КлючЗначение из СтруктураПараметров Цикл
		
		ЗначениеПараметра = Запрос.ПараметрыЗапроса.Получить(КлючЗначение.Ключ);
		
		Если ЗначениеПараметра = Неопределено Тогда
			Ошибка = СтрШаблон("Не задано значение параметра '%1'", КлючЗначение.Ключ);
			МассивОшибок.Добавить(Ошибка);
		Иначе
			СтруктураПараметров.Вставить(КлючЗначение.Ключ, ЗначениеПараметра);	
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура("Параметры, Ошибки", СтруктураПараметров, МассивОшибок);
	
	Возврат Результат;

КонецФункции

Функция СтрокаJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Процедура ДобавитьЗаголовкиДанных(Ответ) Экспорт
	
	Заголовки = Ответ.Заголовки;
	
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Accept-Charset", "utf-8");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");	
	Заголовки.Вставить("Cache-Control", "no-cache");
	
КонецПроцедуры

#КонецОбласти
